JMeter_Examples/Component Examples/Assertions/Compare Assertion.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.0 r1840935">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">${__P(threads,1)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(rampup,1)} </stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,120)}</stringProp>
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="Per Controller" enabled="true"/>
        <hashTree>
          <CompareAssertion guiclass="TestBeanGUI" testclass="CompareAssertion" testname="Compare Assertion - Content" enabled="true">
            <boolProp name="compareContent">true</boolProp>
            <longProp name="compareTime">-1</longProp>
            <collectionProp name="stringsToSkip"/>
          </CompareAssertion>
          <hashTree/>
          <CompareAssertion guiclass="TestBeanGUI" testclass="CompareAssertion" testname="Compare Assertion - Content and Time" enabled="true">
            <boolProp name="compareContent">true</boolProp>
            <longProp name="compareTime">10</longProp>
            <collectionProp name="stringsToSkip"/>
          </CompareAssertion>
          <hashTree/>
          <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler 1 - Pass - Content to compare" enabled="true">
            <boolProp name="WAITING">true</boolProp>
            <boolProp name="SUCCESFULL">true</boolProp>
            <stringProp name="RESPONSE_CODE">200</stringProp>
            <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
            <stringProp name="REQUEST_DATA">GET https://www.example.com/somepath</stringProp>
            <stringProp name="RESPONSE_DATA">{
   &quot;events&quot;: [{
      &quot;contentId&quot;: 330397,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-10-04 00:54:00 +00:00&quot;,
      &quot;campaignId&quot;: 67890,
      &quot;templateId&quot;: 11111,
      &quot;messageId&quot;: &quot;1234example9876&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}, {
      &quot;contentId&quot;: 329261,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-09-30 19:50:00 +00:00&quot;,
      &quot;campaignId&quot;:67890,
      &quot;templateId&quot;: 22222,
      &quot;messageId&quot;: &quot;9876example1234&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}]
}</stringProp>
            <stringProp name="RESPONSE_TIME">10</stringProp>
            <stringProp name="LATENCY">1</stringProp>
            <stringProp name="CONNECT">1</stringProp>
          </kg.apc.jmeter.samplers.DummySampler>
          <hashTree/>
          <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler 2 - Pass - Same content and response time as Sampler #1" enabled="true">
            <boolProp name="WAITING">true</boolProp>
            <boolProp name="SUCCESFULL">true</boolProp>
            <stringProp name="RESPONSE_CODE">200</stringProp>
            <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
            <stringProp name="REQUEST_DATA">GET https://www.example.com/somepath</stringProp>
            <stringProp name="RESPONSE_DATA">{
   &quot;events&quot;: [{
      &quot;contentId&quot;: 330397,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-10-04 00:54:00 +00:00&quot;,
      &quot;campaignId&quot;: 67890,
      &quot;templateId&quot;: 11111,
      &quot;messageId&quot;: &quot;1234example9876&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}, {
      &quot;contentId&quot;: 329261,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-09-30 19:50:00 +00:00&quot;,
      &quot;campaignId&quot;:67890,
      &quot;templateId&quot;: 22222,
      &quot;messageId&quot;: &quot;9876example1234&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}]
}</stringProp>
            <stringProp name="RESPONSE_TIME">10</stringProp>
            <stringProp name="LATENCY">1</stringProp>
            <stringProp name="CONNECT">1</stringProp>
          </kg.apc.jmeter.samplers.DummySampler>
          <hashTree/>
          <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler 3 - Fail - Different content but same response time as Sampler #1 - This fails" enabled="true">
            <boolProp name="WAITING">true</boolProp>
            <boolProp name="SUCCESFULL">true</boolProp>
            <stringProp name="RESPONSE_CODE">200</stringProp>
            <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
            <stringProp name="REQUEST_DATA">GET https://www.example.com/somepath</stringProp>
            <stringProp name="RESPONSE_DATA">{
   &quot;events&quot;: [{
      &quot;contentId&quot;: 330397,
      &quot;recurringCampaignId&quot;: 11,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-10-04 00:54:00 +00:00&quot;,
      &quot;campaignId&quot;: 67890,
      &quot;templateId&quot;: 11111,
      &quot;messageId&quot;: &quot;1234example9876&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}, {
      &quot;contentId&quot;: 329261,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-09-30 19:50:00 +00:00&quot;,
      &quot;campaignId&quot;:67890,
      &quot;templateId&quot;: 22222,
      &quot;messageId&quot;: &quot;9876example1234&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}]
}</stringProp>
            <stringProp name="RESPONSE_TIME">10</stringProp>
            <stringProp name="LATENCY">1</stringProp>
            <stringProp name="CONNECT">1</stringProp>
          </kg.apc.jmeter.samplers.DummySampler>
          <hashTree/>
          <kg.apc.jmeter.samplers.DummySampler guiclass="kg.apc.jmeter.samplers.DummySamplerGui" testclass="kg.apc.jmeter.samplers.DummySampler" testname="Dummy Sampler 4 - Fail - Same content but different repsonse time as Sampler #1 - This fails" enabled="true">
            <boolProp name="WAITING">true</boolProp>
            <boolProp name="SUCCESFULL">true</boolProp>
            <stringProp name="RESPONSE_CODE">200</stringProp>
            <stringProp name="RESPONSE_MESSAGE">OK</stringProp>
            <stringProp name="REQUEST_DATA">GET https://www.example.com/somepath</stringProp>
            <stringProp name="RESPONSE_DATA">{
   &quot;events&quot;: [{
      &quot;contentId&quot;: 330397,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-10-04 00:54:00 +00:00&quot;,
      &quot;campaignId&quot;: 67890,
      &quot;templateId&quot;: 11111,
      &quot;messageId&quot;: &quot;1234example9876&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}, {
      &quot;contentId&quot;: 329261,
      &quot;recurringCampaignId&quot;: 12345,
      &quot;email&quot;: &quot;antonio@flood.io&quot;,
      &quot;createdAt&quot;: &quot;2016-09-30 19:50:00 +00:00&quot;,
      &quot;campaignId&quot;:67890,
      &quot;templateId&quot;: 22222,
      &quot;messageId&quot;: &quot;9876example1234&quot;,
      &quot;eventType&quot;: &quot;emailSend&quot;
}]
}</stringProp>
            <stringProp name="RESPONSE_TIME">${__Random(150,200)}</stringProp>
            <stringProp name="LATENCY">${__Random(1,50)}</stringProp>
            <stringProp name="CONNECT">${__Random(1,5)}</stringProp>
          </kg.apc.jmeter.samplers.DummySampler>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="AssertionVisualizer" testclass="ResultCollector" testname="Assertion Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>